app/controllers/contact_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."email" = $1 LIMIT 1  [["email", "taiyou88@naver.com"]]
---
	def find_email(email)
		if Contact.find_by_email(email).nil?